"""Task 2"""

from loop import loop

#Задание 2. Вычислить количество чисел больше 12 в заданной последовательности.
#Окончание ввода - число 0.
def task2():
    print("Вводите числа через пробел:")
    print(f"Результат. Количество чисел больше 12: {loop()}")

task2()